// #1 რას ნიშნავს Statement


//სიტყვები,რიცხვები და ოპერატორები,რომლებიც ემსახურებიან რაღაც წინაღობის გადაჭრას Statement-ეწოდება.
// Statement-შეიძლება იყოს a = b * 2, აქ a და b ცვლადი, რომელსაც მომავალში მიენიჭება მნიშვნელობა, ხოლო 2 არის მნიშვნელობა
//რომელიც უკვე მინიჭებულია



// #2 რას ნიშნავს Expression


//Statement შედგება ერთი ან რამდენიმე Expression-სგან.

//მაგალითად, a = b * 2 ამ Statement-ს აქვს ოთხი Expression

// 1) 2 არის პირდაპირი Expressions-ის გამოხატულება
// 2) b არის ცვლადი Expression, რაც ნიშნავს ახლანდელ Value-ს
// 3) b * 2 არის მათემატიკური Expression,რომელიც ეუბნება ჩვენს კომპიუტერს, რომ გამრავლების ოპერაცია შემოგვთავაზოს
// 4) a = b * 2 არის მინიჭების Expression,რომელიც ასრულებს გამოთვლას, რათა გავიგოთ რას უდრის a

// მარტო მდგომი expression-ს-(b * 2) ეწოდება 
// expression-satement - გამოხატულება-განცხადება

//გამოხატვის ეს არომატი არ არის ძალიან გავრცელებული ან სასარგებლო, რადგან
//ზოგადად, ეს არ იმოქმედებს პროგრამის გაშვებაზე
//- ის იბრუნებს b-ის მნიშვნელობას და გაამრავლებს მას 2-ზე, მაგრამ შემდეგ
//არაფერს გააკეთებს ამ შედეგით


// #2 Executing a Program

// a = b * 2 ლამაზია ხო ? თითქოს ყველაფერი გასაგებად წერია თავიდან, მეც ასე მეგონა. მაგრამ აქ არის ერთი მაგრამ.
// ეს კოდი არაფრის მომცემია იქამდე სანამ მას Compiler არ გადაიყვანს კომპიუტერისთვის გასაგებ ენაზე სწორედ Compiler-ის
// დახმარების შემდეგ იღებს ჩვენი კოდი ღირებულებას.


// საერთოდ, როგორ უნდა დავინახოთ ჩვენი გაშვებული კოდის შედეგი ? 
// ჩვენ გვაქვს 2 გამოხატულება log და prompt(alert...) log ჩვენს კონსოლში გამოიტანს ჩვენს შედეგს, რათა დავნახოთ ბოლო ჯამში რა მოხდა.
// ხოლო prompt მთლიან windows-ს მოიცავს მაგალითად ჩვენ შეგვიძლია რაიმე კომენტარი გავატანოთ prompt-ს
// let age = prompot("რამდენი წლის ხარ?") და შემდეგ ეს დავლოგოთ console.log(age)
// მივიღებთ ასეთ სურათს მომხარებლის შესვლის შემდეგ ამოვარდება ფანჯარა, რომელიც დასვამს კითხვას რამდენი წლის ხარ ?
// მაგალითად თუ მივუთითებთ 15(ან ნებისმიერ რიცხვს) ჩვენს ტერმინალში ავტომატურად დაკონსლდება ეს რიცხვი.


// ეს ყველაფერი არის Output, ამასობაში Input-იც არ უნდა დაგვავიწყდეს 
// Input და ამ Input-ის Value არის ზუსტად ის რასაც ჩავწერთ შიგნით, ანუ 15

